tap 'bradp/vv'
tap 'heroku/brew'
tap 'homebrew/bundle'
tap 'homebrew/cask'
tap 'homebrew/core'

brew 'apachetop'
brew 'autoconf'
brew 'automake'
brew 'aws-elasticbeanstalk'
brew 'bradp/vv/vv'
brew 'awscli'
brew 'circleci'
brew 'coreutils'
brew 'cscope'
brew 'csv-fix'
brew 'curl'
brew 'duti'
brew 'enca'
brew 'fish'
brew 'fluid-synth'
brew 'fortune'
brew 'gdbm'
brew 'geckodriver'
brew 'gettext'
brew 'git'
brew 'git-flow'
brew 'gnu-getopt'
brew 'gnupg'
brew 'graphviz'
brew 'heroku'
brew 'httpd'
brew 'imagemagick@6', link: true
brew 'libffi'
brew 'libksba'
brew 'libtool'
brew 'libyaml'
brew 'maven'
brew 'nmap'
brew 'node'
brew 'openmotif'
brew 'pdftohtml'
brew 'perl'
brew 'pkg-config'
brew 'postgresql'
brew 'redis'
brew 'ssh-copy-id'
brew 'tomcat'
brew 'v'
brew 'v8'
brew 'wget'
brew 'wordplay'
brew 'yarn'
brew 'zbar'

cask 'alfred'
cask 'cd-to-iterm'
cask 'cyberduck'
cask 'docker'
cask 'dropbox'
cask 'firefox'
cask 'gimp'
cask 'google-chrome'
cask 'google-drive-file-stream'
cask 'hammerspoon'
cask 'intellij-idea'
cask 'iterm2'
cask 'java8'
cask 'karabiner-elements'
cask 'keepassx'
cask 'keeweb'
cask 'kitematic'
cask 'little-snitch'
cask 'mongodb-compass'
cask 'pgadmin4'
cask 'slack'
cask 'sourcetree'
cask 'spotify'
cask 'steam'
cask 'telegram'
cask 'transmission'
cask 'vagrant'
cask 'visual-studio-code'
cask 'vlc'
cask 'whatsapp'
cask 'xquartz'
cask 'zoomus'

# [Quick Look Plugins](https://github.com/sindresorhus/quick-look-plugins) plus some extras
cask 'qlcolorcode'
cask 'qlstephen'
cask 'qlmarkdown'
cask 'quicklook-json'
cask 'qlprettypatch'
cask 'quicklook-csv'
cask 'qlimagesize'
cask 'quicklookase'
cask 'qlvideo'
cask 'provisionql'
cask 'quicklookapk'
cask 'quicklook-pat'
cask 'suspicious-package'
cask 'webpquicklook'

mas 'Kiwi for Gmail', id: 986304488
mas 'Microsoft Remote Desktop 10', id: 1295203466
mas 'Microsoft Remote Desktop (8.0.30030)', id: 715768417
mas 'Numbers', id: 409203825
mas 'Pages', id: 409201541
mas 'Shotty', id: 1250306151
mas 'Tomato One', id: 907364780
mas 'Telegram', id: 747648890