tap 'heroku/brew'
tap 'homebrew/bundle'
tap 'homebrew/cask'
tap 'homebrew/core'

brew 'apachetop'
brew 'autoconf'
brew 'automake'
brew 'aws-elasticbeanstalk'
brew 'awscli'
brew 'circleci'
brew 'coreutils'
brew 'cscope'
brew 'csv-fix'
brew 'curl'
brew 'duti'                 # Allows file type defaulting to be scripted in the duti folder of this project
brew 'enca'
brew 'fish'                 # The shell I like best
brew 'fluid-synth'
brew 'fortune'
brew 'gdbm'
brew 'geckodriver'
brew 'gettext'
brew 'git'
brew 'git-flow'
brew 'gnu-getopt'           # Used to bring in a bunch of Linux utilities and make things more Linux like
brew 'gnupg'                # PGP is good to have around
brew 'graphviz'
brew 'heroku'
brew 'httpd'
brew 'imagemagick@6', link: true # For buyapowa repo
brew 'libffi'
brew 'libksba'
brew 'libpq', link: true    # For buyapowa repo
brew 'libsodium'            # For bp-crm-api repo
brew 'libtool'
brew 'libyaml'
brew 'maven'
brew 'nmap'
brew 'openmotif'
brew 'pdftohtml'
brew 'pkg-config'           # For buyapowa repo
brew 'postgresql'
brew 'redis'
brew 'ssh-copy-id'
brew 'tomcat'
brew 'v'
brew 'v8'
brew 'wget'
brew 'wordplay'
brew 'zbar'                 # For buyapowa repo

cask 'alfred'
cask 'cd-to-iterm'
cask 'cyberduck'
cask 'docker'
cask 'dropbox'
cask 'firefox'
cask 'gimp'
cask 'google-chrome'
cask 'google-drive-file-stream'
cask 'hammerspoon'
cask 'intellij-idea'
cask 'iterm2'
cask 'java8'
cask 'karabiner-elements'
cask 'keepassx'
cask 'keeweb'
cask 'kitematic'                    # Docker GUI app
cask 'little-snitch'                # Can squelch HTTP requests. Not using at the time of writing though.
cask 'mongodb-compass'              # Keeping this around in case of Mongo DBs in work
cask 'pgadmin4'                     # Great browser based Postgres client app
cask 'phantomjs'                    # For buyapowa repo
cask 'slack'                        # For messaging Buyapowa team
cask 'sourcetree'                   # Git GUI app
cask 'spotify'                      # For listening to music
cask 'steam'                        # For playing games
cask 'telegram'                     # For testing Telegram integrations (and messaging if you use Telegram)
cask 'transmission'                 # For BitTorrenting
cask 'vagrant'                      # Back up to docker
cask 'visual-studio-code'           # Back up to Intellij
cask 'vlc'                          # For viewing video content (Quickview is no good)
cask 'whatsapp'                     # For instant messaging
cask 'zoomus'                       # For video calls with Buyapowa team (Slack isn't great at this)

# [Quick Look Plugins](https://github.com/sindresorhus/quick-look-plugins) plus some extras
cask 'qlcolorcode'
cask 'qlstephen'
cask 'qlmarkdown'
cask 'quicklook-json'
cask 'qlprettypatch'
cask 'quicklook-csv'
cask 'qlimagesize'
cask 'quicklookase'
cask 'qlvideo'
cask 'provisionql'
cask 'quicklookapk'
cask 'quicklook-pat'
cask 'suspicious-package'
cask 'webpquicklook'

mas 'Kiwi for Gmail', id: 986304488
mas 'Microsoft Remote Desktop 10', id: 1295203466
mas 'Microsoft Remote Desktop (8.0.30030)', id: 715768417
mas 'Numbers', id: 409203825
mas 'Pages', id: 409201541
mas 'Shotty', id: 1250306151
mas 'Tomato One', id: 907364780
mas 'Telegram', id: 747648890